Tekla Open API Reference for Tekla Structures 2025
PourObject Properties
The PourObject type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the pour. For more information see PourObject.PourAttributes.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
 (Inherited from ModelObject.)
ModelIdentifier
 The database identifier of the model object in the model database. By using this identifier, it is possible to select the actual object in the Tekla Structures model.
 (Inherited from ModelObject.)
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Top
See Also
Reference
PourObject Class
Tekla.Structures.Drawing Namespace